# run the following first to install brew bundle
#
# brew tap homebrew/bundle
#
# then run
# 
# brew bundle
#
# that will do the following
#
#
# getting all our brew basics set up
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/fonts"
tap "caskroom/cask"

# installing Mac App Store CLI interface
brew "mas"

# installing a lovely -rm replacement, 'trash'
brew "trash"

# installing an updated VIM
brew "neovim"

# installing git
brew "git"

# installing our casks
cask "appcleaner"
cask "avibrazil-rdm"
cask "bartender"
cask "beardedspice"
cask "bitwarden"
cask "caffeine"
cask "cheatsheet"
cask "contexts"
cask "daisydisk"
cask "dash"
cask "dropbox"
cask "droplr"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "growlnotify"
cask "iterm2"
cask "keka"
cask "koa11y"
cask "lacona"
cask "little-snitch"
cask "moom"
cask "sip"
cask "streamlink-twitch-gui"
cask "visual-studio-code"
cask "vlc"
cask "caskroom/fonts/font-molengo"
cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-oswald"
cask "caskroom/fonts/font-quattrocento"
cask "caskroom/fonts/font-roboto"
cask "caskroom/fonts/font-roboto-slab"
cask "caskroom/fonts/font-source-sans-pro"

# using mas to install our Mac App Store items
mas "Bear", id: 1091189122
mas "GIFs", id: 961850017
mas "Keynote", id: 409183694
mas "LittleIpsum", id: 405772121
mas "Numbers", id: 409203825
mas "Parcel", id: 639968404
mas "Pocket", id: 568494494
mas "Zen Timer", id: 1031035430